package com.seven.server;

import java.util.Arrays;
import java.util.List;

public class T {
    public static void main(String[] args) {
        String s="旋照期\n" +
                "开光期\n" +
                "练体期\n" +
                "练气期\n" +
                "筑基期\n" +
                "结丹期\n" +
                "元婴期\n" +
                "婴变期\n" +
                "心动期\n" +
                "出窍期\n" +
                "融合期\n" +
                "问鼎期\n" +
                "洞虚期\n" +
                "空冥期\n" +
                "灵寂期\n" +
                "闻道期\n" +
                "分神期\n" +
                "化神期\n" +
                "灵智期\n" +
                "消融期\n" +
                "神动期\n" +
                "灵虚期\n" +
                "练虚期\n" +
                "合道期\n" +
                "合体期\n" +
                "大乘期\n" +
                "渡劫期\n" +
                "仙人\n" +
                "地仙\n" +
                "天仙\n" +
                "真仙\n" +
                "玄仙\n" +
                "金仙\n" +
                "太乙散仙\n" +
                "太乙玄仙\n" +
                "太乙真仙\n" +
                "太乙金仙\n" +
                "太乙玉仙\n" +
                "大罗金仙\n" +
                "大罗仙王\n" +
                "大罗仙君\n" +
                "大罗仙帝\n" +
                "大罗仙尊\n" +
                "预备神人\n" +
                "神人\n" +
                "下部天神\n" +
                "上部天神\n" +
                "天神\n" +
                "大神\n" +
                "金神\n" +
                "玄神\n" +
                "古神\n" +
                "真神\n" +
                "神王\n" +
                "神君\n" +
                "神帝\n" +
                "神皇\n" +
                "神尊\n" +
                "散圣\n" +
                "半圣\n" +
                "圣人\n" +
                "大圣\n" +
                "圣人王\n" +
                "真圣\n" +
                "天圣\n" +
                "造化圣\n" +
                "混沌圣\n" +
                "古荒混沌圣\n" +
                "混沌大神\n" +
                "混沌天神\n" +
                "混沌古神\n" +
                "混沌神王\n" +
                "混沌神君\n" +
                "混沌神帝\n" +
                "混沌神尊\n" +
                "鸿蒙圣\n" +
                "下位神\n" +
                "中位神\n" +
                "上位神\n" +
                "鸿蒙无极圣人\n" +
                "鸿蒙混元圣人\n" +
                "鸿蒙太极圣人\n" +
                "鸿蒙天帝\n" +
                "鸿蒙大天帝\n" +
                "鸿蒙神尊\n" +
                "鸿蒙造化天尊\n" +
                "鸿蒙天尊\n" +
                "鸿蒙大天尊\n" +
                "鸿蒙圣尊\n" +
                "鸿蒙化道\n" +
                "鸿蒙道尊\n" +
                "鸿蒙天道\n" +
                "鸿蒙道祖\n" +
                "鸿蒙掌控者\n" +
                "准虚无之境\n" +
                "虚无之境\n" +
                "虚无仙尊\n" +
                "虚无神尊\n" +
                "虚无圣尊\n" +
                "永痕虚无\n" +
                "不灭虚无\n" +
                "无上虚无\n" +
                "无极虚无\n" +
                "道之虚无\n" +
                "虚无之祖";
        List<String> strings = Arrays.asList("初级", "中级", "高级", "顶级", "圆满");
        String[] split = s.split("\n");
        for (String value : split) {
            for (String string : strings) {
                System.out.println(value + "-" + string);
            }
        }
    }
}
